app/controllers/addresses_controller.rb

  def create
    @address = Address.create(address_params)
---
INSERT INTO `addresses` (`postcode`, `prefecture`, `city`, `block`, `building`, `phone_number`, `user_id`, `created_at`, `updated_at`) VALUES (2270066, '', '', '', '', '', 2, '2020-04-04 08:11:23', '2020-04-04 08:11:23')

  def set_address
    if current_user.id != Address.find(params[:id]).user_id
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1