app/controllers/items_controller.rb

  def index
   @items = Item.includes(:images).order('created_at DESC').limit(3)
---
SELECT `items`.* FROM `items` ORDER BY created_at DESC

  def set_item_information
    @item = Item.find(params[:id])
    @image = @item.images.first
    @images = @item.images.all
    @solder=User.find(@item[:solder_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1